[
        { "clave": "hola", "respuesta": "¡Hola! ¿Necesitás ayuda?" },
        { "clave": "help", "respuesta": "Podés usar el comando help o preguntar lo que quieras sobre benja." },
        { "clave": "gracias", "respuesta": "¡De nada!" },
        { "clave": "inteligencia artificial", "respuesta": "Tengo conocimientos en redes neuronales, aprendizaje no supervisado, NLP y modelos como transformers." },
        { "clave": "ia", "respuesta": "Trabajo con IA usando TensorFlow, PyTorch y OpenAI API para análisis, predicción y generación de contenido." },
        { "clave": "machine learning", "respuesta": "Tengo experiencia con algoritmos de clasificación, regresión, clustering y reducción de dimensionalidad." },
        { "clave": "neuronales", "respuesta": "He implementado redes neuronales profundas para procesamiento de lenguaje natural." },
        { "clave": "pytorch", "respuesta": "Uso PyTorch para deep learning, por su flexibilidad y velocidad de prototipado." },
        { "clave": "tensorflow", "respuesta": "Conozco TensorFlow y Keras para modelos de IA escalables." },
        { "clave": "openai", "respuesta": "Conozco las APIs de OpenAI como GPT para asistentes conversacionales." },
        { "clave": "estas", "respuesta": "Estoy bien, gracias por preguntar." },
        { "clave": "podes", "respuesta": "Puedo responder preguntas sobre la experiencia y conocimientos de Benja." },
        { "clave": "sabes", "respuesta": "Solo se responder sobre mi creador, mediante palabras claves intento adivinar tu pregunta y por eso me equivoco, tambien se esta trabajando en mi primo mayor, pero es tema para otro dia." },
        { "clave": "quien sos", "respuesta": "Soy un asistente virtual creado por Benja para ayudarte." },
        { "clave": "benjamin", "respuesta": "Benjamin Ciro Macias, nacido el 9 de junio de 2001, es desarrollador backend con experiencia en IA y otras tecnologias." },
        { "clave": "desarrollador", "respuesta": "Tiene experiencia con Python, Ruby, C#, JavaScript. Se especializa en backend e inteligencia artificial." },
        { "clave": "python", "respuesta": "Es el lenguaje principal de Benja, lo usa para scripts, APIs, automatización y deep learning, ademas de proyectos en django o trabajos profesionales en odoo." },
        { "clave": "ruby", "respuesta": "Lenguaje que usa para prototipos y automatización." },
        { "clave": "javascript", "respuesta": "Lo usa principalmente para el frontend de sus proyectos personales." },
        { "clave": "c#", "respuesta": "Lo utiliza para desarrollo de videojuegos y herramientas con .NET." },
        { "clave": "frontend", "respuesta": "Tiene conocimientos pero se especializa en backend." },
        { "clave": "tailwind", "respuesta": "Prefiere Tailwind CSS por su flexibilidad en el diseño de interfaces modernas." },
        { "clave": "css", "respuesta": "Conoce CSS puro y frameworks como Bootstrap y Tailwind." },
        { "clave": "bootstrap", "respuesta": "Fue uno de los primeros frameworks que usó para diseño web responsive." },
        { "clave": "sql", "respuesta": "Trabaja conmunmente con base de datos postgresql, siempre relacionales, entiende todos los conceptos aunque a veces puede olvidar algunas cosas y recurre a internet" },
        { "clave": "odoo", "respuesta": "Tiene experiencia en Odoo, especialmente en personalización y desarrollo de módulos." },
        { "clave": "django", "respuesta": "Usa Django para proyectos web que requieren un backend robusto." },
        { "clave": "proyectos", "respuesta": "Tiene varios proyectos personales en GitHub, incluyendo aplicaciones web, y herramientas de automatización. Ahora tambien sumo un alimentador de mascotas completamente funcional con un esp32." }
      ]